OdDAI.OdSDAIInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param attrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute value is set; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdSDAIInstance.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.OdSDAIInstance.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the Standard Data Access Interface (SDAI) instance belongs to a certain entity type with a specified name.
\param entityName [in] An ANSI string that contains the name of entity type.
\returns true if the SDAI instance belongs to the type of entity with the specified name; otherwise, the method returns false.

OdDAI.OdSDAIInstance.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the Standard Data Access Interface (SDAI) instance is an instance of a specified type.
\param entityName [in] An ANSI string that contains the entity's type name.
\returns true if the SDAI instance is an instance of the specified type; otherwise, the method returns false.